# Assignment 2 (Week 2)

>**Note**: Late submissions are ***`penalized`***.

## Name: Elijah Vande

## Installation of packages

In [ ]:
# Installation of packages

! pip install SQLAlchemy
! pip install python-sql
! pip install pymysql
! pip install ipython-sql
!pip install ipython-sql

## Installation of libraries and modules

In [ ]:
# Installation of libraries and modules
import pandas as pd
import sqlite3

In [ ]:
# Loading the sql extension library
%load_ext sql

### The Database can be found [here](https://drive.google.com/file/d/1uIPkJWIHyZ8iQD_tQlM_K-ANoT_Bpy8P/view?usp=sharing)

> Run the command below to see all the tables present in the SQLite DB.

```sql
SELECT name FROM sqlite_master;
```

<hr>
<br>

In [14]:
# Creating a connection to the database
filepath = "/content/week_2.db"
conn = sqlite3.connect(filepath)
cursor = conn.cursor()

In [15]:
# Fecthing all the tables from the data bse
sql_query = """ 
          SELECT name FROM sqlite_master;

"""

# execute

result = cursor.execute(sql_query)
result.fetchall()

[('customers',),
 ('sqlite_sequence',),
 ('orders',),
 ('employee',),
 ('department',),
 ('students',),
 ('sqlite_autoindex_students_1',),
 ('products',)]

In [20]:
# Loading the data base
%sql sqlite:////content/week_2.db

'Connected: @/content/week_2.db'

## Qs 1: 

a. Given the table, `customers` and `orders` shown below, use a **subquery** to find the **customers** that did ***NOT*** place any orders. Display only the customer name(s).

**`customers`**

![image.png](https://i.postimg.cc/sx2WK6v3/image.png)


**`orders`**

![image.png](https://i.postimg.cc/T2H5fcKW/image.png)

b. Given the `products` table shown below:

[![image.png](https://i.postimg.cc/W18dpLXC/image.png)](https://postimg.cc/DSWv5DVP)

write a query that returns the price of each product at every store. Your result should look like this:

[![image.png](https://i.postimg.cc/s235K4Nd/image.png)](https://postimg.cc/FYnfH3vD)

**Hint:** Use `CASE` statement.

### NOTE: You must use a single query.

## Question 1A Answer

In [50]:
# Taking a peep at the customers table
%%sql

SELECT * FROM customers;

 * sqlite:////content/week_2.db
Done.

[(1, 'Mike'), (2, 'Afam'), (3, 'Deborah'), (4, 'Yusuf')]

In [51]:
# Taking a peep at the orders table
%%sql

SELECT * FROM orders;

 * sqlite:////content/week_2.db
Done.

[(1, 5), (2, None), (3, None), (4, 3)]

In [52]:
# Taking a peep at the products table
%%sql

SELECT * FROM products;

 * sqlite:////content/week_2.db
Done.

[(0, 'store a', 10),
 (0, 'store c', 12),
 (1, 'store b', 35),
 (1, 'store a', 33),
 (1, 'store c', 34),
 (0, 'store b', 11)]

In [45]:
%%sql
SELECT name
FROM customers
LEFT JOIN orders ON customers.id = orders.id
WHERE order_id IS NULL;

 * sqlite:////content/week_2.db
Done.

[('Afam',), ('Deborah',)]

## Question 1B Answer

In [48]:
%%sql
SELECT id,
  MAX(CASE WHEN store = 'store a' THEN price END) AS store_a_price,
  MAX(CASE WHEN store = 'store b' THEN price END) AS store_b_price,
  MAX(CASE WHEN store = 'store c' THEN price END) AS store_c_price
FROM products
GROUP BY id;

 * sqlite:////content/week_2.db
Done.

[(0, 10, 11, 12), (1, 33, 35, 34)]

## Qs 2: 

Given the tables `employee` and `department` shown below:

![image.png](https://i.postimg.cc/bw0J574p/image.png)

a. Write a query that generates the table shown below:

![image](https://i.postimg.cc/hjc3rdTK/image.pnghttps://i.postimg.cc/hjc3rdTK/image.png)

b. Write a query that determines the **highest earner** in **each department**.

c. Write a query that shows all the employees in each department **except** the **lowest earner**. i.e generate the table below

![image.png](https://i.postimg.cc/MHcmw7Q0/image.png)

In [49]:
# Taking a peep at the employee table
%%sql
SELECT *
FROM employee;

 * sqlite:////content/week_2.db
Done.

[(1, 'Steve', 32000, 1),
 (2, 'Bola', 31000, 1),
 (3, 'Felix', 33000, 2),
 (4, 'Babalola', 30200, 1),
 (5, 'Okafor', 25000, 2),
 (6, 'Adigun', 30000, 1),
 (7, 'Gafar', 41000, 2),
 (8, 'Amanda', 53000, 2)]

In [35]:
# Taking a peep at the department table
%%sql
SELECT *
FROM department;

 * sqlite:////content/week_2.db
Done.

[(1, 'Sales'), (2, 'IT')]

## Question 2A Answer

In [37]:
%%sql
SELECT e.name, e.salary, d.dept_name
FROM employee e
JOIN department d ON e.dept_id = d.id
WHERE (e.dept_id = 1 AND d.dept_name = 'Sales') OR (e.dept_id = 2 AND d.dept_name = 'IT');

 * sqlite:////content/week_2.db
Done.

[('Steve', 32000, 'Sales'),
 ('Bola', 31000, 'Sales'),
 ('Babalola', 30200, 'Sales'),
 ('Adigun', 30000, 'Sales'),
 ('Felix', 33000, 'IT'),
 ('Okafor', 25000, 'IT'),
 ('Gafar', 41000, 'IT'),
 ('Amanda', 53000, 'IT')]

## Question 2B Answer

In [38]:
%%sql
SELECT e.name, e.salary, d.dept_name
FROM employee e
JOIN department d ON e.dept_id = d.id
WHERE (e.dept_id, e.salary) IN 
    (SELECT dept_id, MAX(salary)
     FROM employee
     GROUP BY dept_id);

 * sqlite:////content/week_2.db
Done.

[('Steve', 32000, 'Sales'), ('Amanda', 53000, 'IT')]

## Question 2C Answer

In [39]:
%%sql
SELECT e.name, e.salary, d.dept_name
FROM employee e
JOIN department d ON e.dept_id = d.id
WHERE (e.dept_id, e.salary) NOT IN 
    (SELECT dept_id, MIN(salary)
     FROM employee
     GROUP BY dept_id)
ORDER BY d.dept_name, e.salary DESC;

 * sqlite:////content/week_2.db
Done.

[('Amanda', 53000, 'IT'),
 ('Gafar', 41000, 'IT'),
 ('Felix', 33000, 'IT'),
 ('Steve', 32000, 'Sales'),
 ('Bola', 31000, 'Sales'),
 ('Babalola', 30200, 'Sales')]

### Qs 3: Given the students table:

a. Write a query that creates a new column `percentage_score`.  The `percentage_score` is the mean of all the subjects for each student. Round the `percentage_score` to 2 decimal points and sort in descending order.

b. Write a query that selects **ONLY** the students that scored more than the mean of the `percentage_score`.

In [25]:
%%sql

SELECT * FROM students;

 * sqlite:////content/week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77),
 ('ux-012-017', 'Fred', 'M', 28, 57, 39),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78),
 ('ux-012-019', 'Steve', 'M', 61, 69, 72),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85),
 ('ux-012-021', 'Samantha', 'F', 52, 69, 48),
 ('ux-012-022', 'Philip', 'M', 51, 39, 45),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70),
 ('ux-012-024', 'Seyi', 'M', 54, 83, 63)]

## Question 3A Answer

In [26]:
%%sql
SELECT matric_no, name, gender, maths, english, physics, 
  ROUND(((maths + english + physics) / 3), 2) AS percentage_score
FROM students
ORDER BY percentage_score DESC;

 * sqlite:////content/week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94, 91.0),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85, 88.0),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91, 87.0),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88, 79.0),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78, 75.0),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70, 72.0),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77, 71.0),
 ('ux-012-019', 'Steve', 'M', 61, 69, 72, 67.0),
 ('ux-012-024', 'Seyi', 'M', 54, 83, 63, 66.0),
 ('ux-012-021', 'Samantha', 'F', 52, 69, 48, 56.0),
 ('ux-012-022', 'Philip', 'M', 51, 39, 45, 45.0),
 ('ux-012-017', 'Fred', 'M', 28, 57, 39, 41.0)]

## Question 3B Answer

In [31]:
%%sql
SELECT matric_no, name, gender, maths, english, physics, 
ROUND((maths + english + physics) / 3.0, 2) AS percentage_score
FROM students
WHERE (maths + english + physics) / 3.0 > 
(SELECT AVG((maths + english + physics) / 3.0) FROM students);

 * sqlite:////content/week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94, 91.0),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88, 79.0),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77, 71.67),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78, 75.67),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91, 87.0),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85, 88.67),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70, 72.0)]